Revit 2024 API
SelectionUIOptions Members
The SelectionUIOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the SelectionUIOptions
ElementSelectsAsPinned
 Checks whether the specified element will be treated as pinned for the purposes of selection.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSelectionUIOptions
 Returns the current user's SelectionOptions.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ActivateControlsAndDimensionsOnMultiSelect
 Indicates whether controls and temporary dimensions are activated on selection of multiple elements.
DragOnSelection
 Indicates whether elements can be dragged immediately when they are selected.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SelectFaces
 Indicates whether elements can be selected by clicking on the interior of a face.
SelectLinks
 Indicates whether Revit and CAD link instances can be selected.
SelectPinned
 Indicates whether pinned elements can be selected.
SelectUnderlay
 Indicates whether elements that are displayed as underlay can be selected.
See Also
SelectionUIOptions Class
Autodesk.Revit.UI Namespace